# High salaried employees

In [1]:
from ATENA_PRO.src.ATENA_A_EDA.benchmark.atena.simulation.dataset import DatasetMeta, SchemaName, \
    Dataset, SalariesDatasetName

In [2]:
dataset_meta = DatasetMeta(SchemaName.SALARIES, SalariesDatasetName.DATASET1)
dataset = Dataset(dataset_meta)
dataset_df = dataset.load_data()

dataset_df.head()

,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
work_year,,,,,,,,,,
2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

### Queries

In [9]:
# filter for employees with salary above 219,000
high_salary = dataset_df[dataset_df['salary_in_usd'] > 219000]
high_salary.head()

,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
work_year,,,,,,,,,,
2023,SE,FT,Applied Scientist,222200,USD,222200,US,0,US,L
2023,SE,FT,Research Engineer,275000,USD,275000,DE,0,DE,M
2023,SE,FT,Analytics Engineer,230000,USD,230000,GB,100,GB,M
2023,SE,FT,Business Intelligence Engineer,225000,USD,225000,US,0,US,M
2023,SE,FT,Data Engineer,253200,USD,253200,US,0,US,M

In [10]:
# calculate summary statistics for numeric columns
high_salary.describe()

             salary  salary_in_usd  remote_ratio
count  3.750000e+02     375.000000    375.000000
mean   2.617837e+05  259129.821333     39.066667
std    7.485013e+04   40274.157452     48.373915
min    2.195350e+05  219535.000000      0.000000
25%    2.302000e+05  230200.000000      0.000000
50%    2.495000e+05  249500.000000      0.000000
75%    2.750000e+05  275000.000000    100.000000
max    1.500000e+06  450000.000000    100.000000

In [11]:
# count the number of employees in each job title
high_salary['job_title'].value_counts()

Data Engineer                         125
Data Scientist                         72
Machine Learning Engineer              36
Data Science Manager                   21
Applied Scientist                      15
Research Scientist                     13
Analytics Engineer                     12
Data Architect                         11
ML Engineer                             9
Machine Learning Scientist              7
Research Engineer                       7
Data Analyst                            7
Computer Vision Engineer                4
Head of Data                            4
Director of Data Science                4
Machine Learning Software Engineer      4
Principal Data Scientist                3
ETL Developer                           3
AI Developer                            2
NLP Engineer                            2
Head of Data Science                    2
Data Science Lead                       2
Data Lead                               1
Data Science Tech Lead                  1
Business Intelligence Engineer          1
Cloud Data Architect                    1
Data Specialist                         1
Data Analytics Lead                     1
Applied Data Scientist                  1
AI Scientist                            1
Lead Data Engineer                      1
Applied Machine Learning Scientist      1
Name: job_title, dtype: int64